# InaccurateWall Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..InaccurateFailures..::..InaccurateWall Property
BuiltInFailures..::..InaccurateFailures Class See Also
---
Wall is slightly off axis and may cause inaccuracies.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId InaccurateWall { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property InaccurateWall As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ InaccurateWall {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..InaccurateFailures Class
Autodesk.Revit.DB Namespace